<?php

namespace common\components;
/**
 * Created by ru.lexcorp.
 * User: lexcorp
 * Date: 20.10.2017
 * Time: 10:40
 */


class Helper
{
    // Кириллица в Латыницу
    public static function toLatin($title)
    {
        $array = array(
            "а" => "a",
            "б" => "b",
            "в" => "v",
            "г" => "g",
            "д" => "d",
            "е" => "ye",
            "ё" => "yo",
            "ж" => "zh",
            "з" => "z",
            "и" => "i",
            "й" => "y",
            "к" => "k",
            "л" => "l",
            "м" => "m",
            "н" => "n",
            "о" => "o",
            "п" => "p",
            "р" => "r",
            "с" => "s",
            "т" => "t",
            "у" => "u",
            "ф" => "f",
            "х" => "h",
            "ч" => "ch",
            "ш" => "sh",
            "щ" => "sch",
            "ь" => "",
            "ы" => "y",
            "ъ" => "",
            "э" => "e",
            "ю" => "yu",
            "я" => "ya",
            "ц" => "ts",

            "А" => "a",
            "Б" => "b",
            "В" => "v",
            "Г" => "g",
            "Д" => "d",
            "Е" => "ye",
            "Ё" => "yo",
            "Ж" => "zh",
            "З" => "z",
            "И" => "i",
            "Й" => "y",
            "К" => "k",
            "Л" => "l",
            "М" => "m",
            "Н" => "n",
            "О" => "o",
            "П" => "p",
            "Р" => "r",
            "С" => "s",
            "Т" => "t",
            "У" => "u",
            "Ф" => "f",
            "Х" => "h",
            "Ч" => "ch",
            "Ш" => "sh",
            "Щ" => "sch",
            "Ь" => "",
            "Ы" => "y",
            "Ъ" => "",
            "Э" => "e",
            "Ю" => "yu",
            "Я" => "ya",
            "Ц" => "ts",
            " " => "-",
        );
        $sim = "/\W/i";
        $title = mb_strtolower(strtr($title, $array));
        return preg_replace($sim, "_", $title);
    }
}